reference/guix-connman.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Connecting to a Wi-Fi network from Guix using ConnMan</title>
<meta property="og:title" content="Connecting to a Wi-Fi network from Guix using ConnMan" />
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="org-div-home-and-up">
  <a accesskey="u" href="index.html">Up</a> | <a accesskey="h" href="../index.html">Home</a>
</div><div id="content" class="content">
<h1 class="title">Connecting to a Wi-Fi network from Guix using ConnMan</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#setting-up-the-connman-service-in-guix">2. Setting up the ConnMan service in Guix</a>
<ul>
<li><a href="#checking-the-service">2.1. Checking the service</a></li>
</ul>
</li>
<li><a href="#connecting-to-a-protected-wi-fi-network-using-connmanctl">3. Connecting to a protected Wi-Fi network using <code>connmanctl</code></a></li>
<li><a href="#checking-the-interface-status">4. Checking the interface status</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
I have been using <a href="https://wiki.archlinux.org/title/Iwd">iwd</a> and its <a href="https://man.cx/iwctl(1)"><code>iwctl(1)</code></a> tool for a long time, but when using
switching to a <a href="https://guix.gnu.org/">Guix system</a>, I realized that there is not much support for it
yet.
</p>

<p>
Alternatively, one might use <a href="https://guix.gnu.org/manual/devel/en/html_node/Services.html">Guix services</a> like <a href="https://guix.gnu.org/manual/devel/en/html_node/Networking-Setup.html#index-network_002dmanager_002dservice_002dtype"><code>network-manager-service-type</code></a>
or <a href="https://guix.gnu.org/manual/devel/en/html_node/Networking-Setup.html#index-connman_002dservice_002dtype"><code>connman-service-type</code></a>. I will be using the later, along with
<a href="https://guix.gnu.org/manual/devel/en/html_node/Networking-Setup.html#index-wpa_002dsupplicant_002dservice_002dtype"><code>wpa-supplicant-service-type</code></a>.
</p>

<p>
I would also like to note that there is a <code>'(iwd)</code> value we could use for the
<code>shepherd-requirement</code> parameter, but currently (01/01/2025) it&rsquo;s not really
supported.
</p>
</div>
</div>

<div id="outline-container-setting-up-the-connman-service-in-guix" class="outline-2">
<h2 id="setting-up-the-connman-service-in-guix"><span class="section-number-2">2.</span> Setting up the ConnMan service in Guix</h2>
<div class="outline-text-2" id="text-setting-up-the-connman-service-in-guix">
<p>
In your <a href="https://guix.gnu.org/manual/devel/en/html_node/System-Configuration.html">Guix system configuration</a>, you will have to include the following
modules:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #a60000;">(</span><span style="color: #972500;">use-modules</span>
 <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
 <span style="color: #695500;">(</span>gnu services networking<span style="color: #695500;">)</span><span style="color: #a60000;">)</span>
</pre>
</div>

<p>
And then add the actual services to your <code>(operating-system ...)</code> declaration:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #a60000;">(</span>operating-system
 <span style="color: #595959;">;; </span><span style="color: #595959;">Other parameters...</span>

 <span style="color: #695500;">(</span>services
  <span style="color: #595959;">;; </span><span style="color: #595959;">Other services...</span>

  <span style="color: #006800;">(</span>service wpa-supplicant-service-type<span style="color: #006800;">)</span>
  <span style="color: #006800;">(</span>service connman-service-type
           <span style="color: #008899;">(</span>connman-configuration
            <span style="color: #0000ff;">(</span>shepherd-requirement '<span style="color: #dd22dd;">(</span>wpa-supplicant<span style="color: #dd22dd;">)</span><span style="color: #0000ff;">)</span>
            <span style="color: #0000ff;">(</span>general-configuration
             <span style="color: #dd22dd;">(</span>connman-general-configuration
              <span style="color: #a60000;">(</span>allow-hostname-updates? #f<span style="color: #a60000;">)</span>
              <span style="color: #a60000;">(</span>allow-domainname-updates? #f<span style="color: #a60000;">)</span>
              <span style="color: #a60000;">(</span>single-connected-technology? #f<span style="color: #a60000;">)</span><span style="color: #dd22dd;">)</span><span style="color: #0000ff;">)</span><span style="color: #008899;">)</span><span style="color: #006800;">)</span><span style="color: #695500;">)</span><span style="color: #a60000;">)</span>
</pre>
</div>

<p>
In this case we are using the default settings for WPA Supplicant, but we are
specifying some other options for ConnMan. We could also specify some other
ConnMan settings like <code>(disable-vpn? #t)</code> by adding it to the
<code>connman-configuration</code>. For more information on available settings, see
<a href="https://guix.gnu.org/manual/devel/en/html_node/Networking-Setup.html#index-index-connman_002dgeneral_002dconfiguration"><code>connman-general-configuration</code></a>.
</p>

<p>
Once our configuration is updated, we can reconfigure our system with:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #595959;"># </span><span style="color: #595959;">Change the path to match your system configuration.</span>
sudo -E guix system reconfigure ~/.config/guix/system.scm
</pre>
</div>
</div>

<div id="outline-container-checking-the-service" class="outline-3">
<h3 id="checking-the-service"><span class="section-number-3">2.1.</span> Checking the service</h3>
<div class="outline-text-3" id="text-checking-the-service">
<p>
Once the system is reconfigured and rebooted, make sure the service is enabled
and running by checking its <a href="https://www.gnu.org/software/shepherd/manual/shepherd.html#Invoking-herd"><code>herd</code> status</a>:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ sudo herd status
Started:
 ...
 + connman
 ...
 + wpa-supplicant
 ...

$ sudo herd status connman
- Status of connman:
  It is running since <span style="color: #2a5045;">09:04:18</span> AM (<span style="color: #2a5045;">44</span> minutes ago)<span style="color: #721045;">.</span>
  Main PID: <span style="color: #2a5045;">309</span>
  Command: /gnu/store/[...]-connman-1.42/sbin/connmand --config=/gnu/store/[...]-main.conf --nodaemon --nodnsproxy --noplugin=vpn
  It is enabled.
  Provides: connman networking
  Requires: user-processes dbus-system loopback wpa-supplicant
  Will be respawned.
  Log file: /var/log/connman.log

$ sudo herd status wpa-supplicant
- Status of wpa-supplicant:
  It is running since <span style="color: #2a5045;">09:04:18</span> AM (<span style="color: #2a5045;">45</span> minutes ago)<span style="color: #721045;">.</span>
  Main PID: <span style="color: #2a5045;">288</span>
  Command: /gnu/store/[...]-wpa-supplicant-2.10/sbin/wpa_supplicant -P/var/run/wpa_supplicant.pid -B -s -u
  It is enabled.
  Provides: wpa-supplicant
  Requires: dbus-system user-processes loopback syslogd
  Will be respawned.
</pre>
</div>

<p>
If you get a socket error like:
</p>

<div class="org-src-container">
<pre class="src src-bash">herd: error: /run/user/1000/shepherd/socket: No such file or directory
</pre>
</div>

<p>
It means your user doesn&rsquo;t have enough privileges, so you should run that
command with <code>sudo</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-connecting-to-a-protected-wi-fi-network-using-connmanctl" class="outline-2">
<h2 id="connecting-to-a-protected-wi-fi-network-using-connmanctl"><span class="section-number-2">3.</span> Connecting to a protected Wi-Fi network using <code>connmanctl</code></h2>
<div class="outline-text-2" id="text-connecting-to-a-protected-wi-fi-network-using-connmanctl">
<p>
Once the service is enabled and running, we can connect to the network using
<code>connmanctl</code>. Since we are connecting to a protected network, we will need to use
the program in interactive mode by running:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ connmanctl
</pre>
</div>

<p>
First, scan for wifi networks:
</p>

<div class="org-src-container">
<pre class="src src-bash">connmanctl&gt; scan wifi
</pre>
</div>

<p>
Then list the available networks:
</p>

<div class="org-src-container">
<pre class="src src-bash">connmanctl&gt; services
*AO MyNetwork               wifi_dc85de828967_68756773616d_managed_psk
    OtherNET                wifi_dc85de828967_38303944616e69656c73_managed_psk
    AnotherOne              wifi_dc85de828967_3257495245363836_managed_wep
    FourthNetwork           wifi_dc85de828967_4d7572706879_managed_wep
    AnOpenNetwork           wifi_dc85de828967_4d6568657272696e_managed_none
</pre>
</div>

<p>
Register the <i>agent</i> to handle user requests:
</p>

<div class="org-src-container">
<pre class="src src-bash">connmanctl&gt; agent on
</pre>
</div>

<p>
Connect to one of the networks using the <code>wifi_</code> name.
</p>

<div class="org-src-container">
<pre class="src src-bash">connmanctl&gt; connect wifi_dc85de828967_68756773616d_managed_psk
</pre>
</div>

<p>
If it&rsquo;s your first time connecting, you will need to enter the password:
</p>

<div class="org-src-container">
<pre class="src src-bash">Agent RequestInput wifi_dc85de828967_38303944616e69656c73_managed_psk
  Passphrase = [ <span style="color: #005f5f;">Type</span>=psk, <span style="color: #005f5f;">Requirement</span>=mandatory ]
  Passphrase?
</pre>
</div>

<p>
After that, you can exit the <code>connmanctl</code> program:
</p>

<div class="org-src-container">
<pre class="src src-bash">connmanctl&gt; quit
</pre>
</div>
</div>
</div>

<div id="outline-container-checking-the-interface-status" class="outline-2">
<h2 id="checking-the-interface-status"><span class="section-number-2">4.</span> Checking the interface status</h2>
<div class="outline-text-2" id="text-checking-the-interface-status">
<p>
ConnMan will also handle DHCP, so we should get a dynamic IP automatically. You
can check the interface status with <a href="https://man.cx/ip-address(8)"><code>ip-address(8)</code></a>:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ ip a
<span style="color: #2a5045;">1:</span> lo: &lt;LOOPBACK,MULTICAST,UP,LOWER_UP&gt; mtu <span style="color: #2a5045;">65536</span> qdisc noqueue state UNKNOWN group default qlen <span style="color: #2a5045;">1000</span>
    link/loopback <span style="color: #2a5045;">00:00:00:00:00:00</span> brd <span style="color: #2a5045;">00:00:00:00:00:00</span>
    inet <span style="color: #2a5045;">127.0.0.1/8</span> scope global lo
       valid_lft forever preferred_lft forever
    inet6 ::1/128 scope host proto kernel_lo
       valid_lft forever preferred_lft forever
<span style="color: #2a5045;">2:</span> enp0s25: &lt;NO-CARRIER,BROADCAST,MULTICAST,DYNAMIC,UP&gt; mtu <span style="color: #2a5045;">1500</span> qdisc pfifo_fast state DOWN group default qlen <span style="color: #2a5045;">1000</span>
    link/ether <span style="color: #2a5045;">11:22:33:aa:bb:cc</span> brd ff:ff:ff:ff:ff:ff
<span style="color: #2a5045;">3:</span> wlp3s0: &lt;BROADCAST,MULTICAST,DYNAMIC,UP,LOWER_UP&gt; mtu <span style="color: #2a5045;">1500</span> qdisc noqueue state UP group default qlen <span style="color: #2a5045;">1000</span>
    link/ether <span style="color: #2a5045;">44:55:66:aa:bb:cc</span> brd ff:ff:ff:ff:ff:ff
    inet <span style="color: #2a5045;">192.168.0.2/24</span> brd <span style="color: #2a5045;">192.168.0.255</span> scope global wlp3s0
       valid_lft forever preferred_lft forever
    inet6 aaaa::bbbb:111:2222:3333/64 scope link proto kernel_ll
       valid_lft forever preferred_lft forever
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
